import random 
def nick_generator(text):
    style = ["𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ","𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖rtyu𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ","𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ","𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ",
    "𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ","𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ",
    "𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ","𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶","𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕔𝕧𝕓𝕟𝕞","ＱＷＥＲＴＹＵＩＯＰＡＳＤԲＧＨＪＫＬＺＸСＶＢＮⅯ"
    ]
    emojies = ["🐬","💟","♈️","🐛","☘️","🎄","✨","🌟","❄️","👻","💃","🤑","😺","👉👈","👀","👼","👑","🕸","🐊","🦥","💦","🪐","❄️","🔥","🖇"]
    total_result="Natija:\n"
    for j in style: 
        result = text
        emoji = random.choice(emojies)
        for index,i in enumerate("qwertyuiopasdfghjklzxcvbnm"):
            result = result.replace(i,j[index])
        total_result += f"<code>{emoji}{result}{emoji}</code>\n"
    return total_result